[{"title": "BaT Auction: 2008 Chevrolet Corvette Callaway C16 Coupe", "comments": "\nThis 2008 Chevrolet Corvette Callaway C16 coupe was the ninth example built by Callaway Cars, and it now shows 66k miles. The unique bodywork was refinished in Velocity Yellow over a customized black interior, and its Callaway-supercharged 6.2-liter V8 drives the rear wheels through a six-speed automatic transmission. Additional features include a removable targa roof panel, color-keyed Forgiato wheels, Callaway brake calipers, carbon-fiber interior trim, air conditioning, and satin-finished gauge faces. The selling dealer serviced the car in June 2020. This Callaway C16 coupe is now offered with a $167k invoice for the Callaway conversion work, a clean Carfax report, and a clean Pennsylvania title.\n"}, {"title": "BaT Auction: 34-Years-Owned 1980 Ferrari 308 GTSi", "comments": "\nThis 1980 Ferrari 308 GTSi is powered by a 2.9L quad-cam V8 paired with a five-speed manual transaxle and is finished in black over tan leather. The seller acquired the car in 1986 and has added 16k of the just over 65k miles shown. Modifications include 16″ Superformance wheels, a Birdman fuse box, Nardi steering wheel, a modified exhaust system, a Norwood Autocraft power window relay, and a Sony head unit. A timing belt service was completed in January 2017, and work in July 2020 included a mechanical inspection and replacement of the spark plugs and cold-start valve. This 308 GTSi is now offered with service records, the removed factory wheels, and a clean Louisiana title in the seller’s name.\n"}, {"title": "BaT Auction: 1962 Alfa Romeo 2600 Spider", "comments": "\nThis 1962 Alfa Romeo 2600 Spider is finished in Grigio Biacca with a black soft top over a red leather interior, and its 2.6-liter inline-six is paired with a five-speed manual transmission. The car is said to have been built in late 1962 before delivery to Belgium and spent many decades there as well as in neighboring Netherlands. In 2012 a specialist near Modena, Italy disassembled the car, refinished the exterior, refreshed the interior, and rebuilt the engine. Refurbishment work reportedly totaled approximately 1,500 hours over 18 months, and the current owner acquired the car out of France in 2014. Later that year the car was imported to the United States and subsequently serviced at Brighton Motorsports in Scottsdale, Arizona. This Spider is now offered by the selling dealer on behalf of the owner with recent receipts and a clean Arizona title.\n"}, {"title": "BaT Auction: 1927 Ford Model T Tudor Sedan at No Reserve", "comments": "\nThis 1927 Ford Model T Tudor sedan comes from the model’s final year of production and was purchased by the seller five years ago from a family friend, who had reportedly kept the car in storage in Idaho for several decades. The seller media blasted the bodywork, commissioned a repaint in green with black fenders, reupholstered the interior in gray cloth, and rebuilt the 177ci inline-four, two-speed planetary gear transmission, and rear differential. This Model T is now offered at no reserve with service manuals, records of the work performed by the seller, and a clean Washington title.\n"}, {"title": "BaT Auction: 21k-Mile 2002 Ferrari 360 Spider 6-Speed", "comments": "\nThis 2002 Ferrari 360 Spider was sold new by Wide World Ferrari of Spring Valley, New York and acquired by the current owner in 2016. The car is finished in Grigio Ingrid over Crema and Cuoio leather and powered by a 3.6-liter V8 mated to a six-speed manual transaxle. Equipment includes a limited-slip differential, a power-retractable black soft top, a Challenge-style rear grille, a Hamann Motorsport exhaust system, Daytona-style seats, and a factory CD player with a McIntosh amplifier and Hertz speakers. A timing belt service was completed and a catalyst ECU was replaced in 2016, while the immobilizer ECU and interface were repaired in 2018. This 360 Spider indicates just under 21k miles and is offered on behalf of the current owner with a car cover and accessories, manufacturer’s literature, service records, a clean Carfax report, and a clean Georgia title.\n"}, {"title": "BaT Auction: 383-Powered 1979 Chevrolet Camaro Z28", "comments": "\nThis 1979 Chevrolet Camaro Z28 was recently acquired by the selling dealer and was refurbished during previous ownership. Work included a repaint in black, reupholstering the interior, and installing a 383ci stroker V8, a Turbo-Hydramatic automatic transmission, and a Vintage Air air-conditioning system. Other equipment includes 15″ wheels, a dual exhaust system, power windows and door locks, and a Dual CD stereo. This Z28 is now offered by the selling dealer with a selection of spares, two sets of keys, refurbishment documentation, a build sheet, and a clean Nevada title.\n"}, {"title": "BaT Auction: Modified 1996 Toyota Land Cruiser FZJ80", "comments": "\nThis 1996 Toyota Land Cruiser has been modified with lifted suspension, 37″ tires, 5.29:1 gears, 4x4labs bumpers, a snorkel, Recaro seats, aftermarket audio components, and more. Power is from a 4.5-liter inline-six mated to a four-speed automatic transmission, a two-speed transfer case, and locking front, center, and rear differentials. The seller acquired the truck in 2019 and has since added approximately 15k of its 345k miles as well as replacing the spark plugs and performing an oil change. This FZJ80 is offered with manufacturer’s literature, partial records, a clean Carfax report, and a clean Texas title in the seller’s name.\n"}, {"title": "BaT Auction: 1973 Alfa Romeo Montreal", "comments": "\nThis Alfa Romeo Montreal was manufactured in July 1973 for original delivery to Frankfurt, Germany, and is said to have been imported to the US approximately 13 years ago before being acquired by the seller in 2016. Originally metallic green over an Avana beige interior, the car is now finished in red over black leather, and power is from a 2.6-liter V8 paired with a five-speed manual transmission and a limited-slip differential. Service since importation is said to have included refurbishment of the SPICA mechanical fuel injection pump and thermostatic actuator, installation of a new fuel pump, a tune-up, installation of a Harvey Bailey handling kit, and refurbishment of the Campagnolo wheels. This Montreal was previously listed on BaT in December 2019 and is now offered again by the same seller with manufacturer’s literature, period parts catalogs, tools, and a clean California title in the seller’s name.\n"}, {"title": "BaT Auction: 1973 Volvo 1800ES 4-Speed w/Overdrive", "comments": "\nThis 1973 Volvo 1800ES is said to have been sold new in Ohio and was acquired by the late owner out of Michigan in 1987. The car is finished in orange over a black interior and powered by a 2.0-liter inline-four paired with a four-speed manual transmission with overdrive. It was recommissioned in September 2019 following a period of storage, and work included replacing the fuel pump and hoses, cleaning the fuel tank, replacing the brake master cylinder and calipers, and more detailed below. This 1800ES is offered by the trustee of the owner’s estate with recent service records, an owner’s manual, and a clean Wisconsin title.\n"}, {"title": "BaT Auction: 1970 Opel GT 1900", "comments": "\nThis 1970 Opel GT 1900 was purchased new from S&S Buick in Manchester, Connecticut and remained with its original until approximately 2018, after which it was purchased from a Massachusetts dealer by the seller and moved to Florida. The car is finished in red over black, and power is from a 1.9-liter inline-four backed by a four-speed manual transmission. The seller has driven under 500 miles and commissioned service including brake work, a carburetor rebuild, a tune-up, a fuel system cleaning, installation of four new tires, replacement of the battery, and more. A new aluminum radiator was installed and repairs to the headlamp wiring and auxiliary gauges were carried out in preparation for the sale. This Opel GT is offered with recent service records, a shop manual, and a clean Florida title in the seller’s name.\n"}, {"title": "BaT Auction: 1981 Honda Accord 5-Speed at No Reserve", "comments": "\nThis 1981 Honda Accord sedan was first sold by Gardena Honda Automobiles of Gardena, California and has since remained registered in the state. The car is finished in silver over a red cloth interior and power is from a carbureted 1.8-liter inline-four paired with a five-speed manual transaxle. Since acquiring the car from a Honda mechanic in Berkeley, California a decade ago, the seller serviced the clutch hydraulics in 2015 and performed an oil change last year. This Accord is offered with manufacturer’s literature, an accident-free Carfax report, and a clean California title in the seller’s name.\n"}, {"title": "BaT Auction: Modified 1971 Porsche 911E 2.7L", "comments": "\nThis 1971 Porsche 911E was acquired by the current owner in 2018 and subsequently modified in the style of a Carrera RS. The color scheme was designed by Sara Wilson, former Head of Fine Materials at Singer, and the car is now finished in Rubystone Red, and the interior features sport seats and Oxford Blue leather complemented by blue and purple tartan accents. A five-speed Type 901 manual transaxle is mated to a fuel-injected 2.7L flat-six equipped with 911S camshafts, 930 chain tensioners, a reflowed MFI pump and injectors, and a ceramic-coated exhaust system. Other additions include staggered-width Fuchs wheels, Koni dampers, upgraded torsion and sway bars, a vintage-look stereo, Rennline pedals and toe boards, and more detailed in the listing. This 911E is now offered on behalf of the current owner in California with a clean Montana title.\n"}, {"title": "58 BaT Auctions Closing Today", "comments": "\n\n\n1972 BMW 3.0 CSL 3.5L 5-Speed\nVortec-Powered 1988 Toyota Land Cruiser FJ62\n\n\n1974 Alfa Romeo GTV 2000\nEuro 1973 BMW 3.0CSi\n\n\nNo Reserve: 1958 MG MGA Mk 1\nModified 1971 DeTomaso Pantera\n\n\nModified 1979 Porsche 911SC\n1956 Imperial Sedan\n\n\n12k-Mile 2002 Porsche 911 Turbo\nNo Reserve: 2014 Mercedes-Benz SLS AMG GT Roadster\n\n\n1967 Porsche 912\n350-Powered 1983 Jeep CJ-8 Scrambler\n\n\n1947 Allard K1\n7k-Mile 1982 Honda CBX Supersport\n\n\nNo Reserve: 47k-Mile 1994 Chevrolet C2500 Silverado\n1967 Volvo 122S Wagon\n\n\nCustom 1967 Ford Mustang Pro-Street\nSupercharged 1996 Porsche 911 Carrera 4S\n\n\n1972 Mercedes-Benz 280SE 4.5\nNo Reserve: 1993 Ford F-150 Lightning\n\n\n13k-Mile 1999 BMW M Roadster\nNo Reserve: Heuer Monte Carlo and Super Autavia Dash Timers\n\n\n1967 Oldsmobile Toronado\n1987 Porsche 911 Carrera Targa\n\n\n1967 Pontiac Firebird 326 H.O. Convertible\n26-Years-Owned 1971 Volkswagen Karmann Ghia\n\n\n1954 Austin-Healey 100S Tribute\nSupercharged 1974 Mini 5-Speed\n\n\n1988 Toyota 4×4 Pickup Xtracab SR5 V6 5-Speed\nNo Reserve: 1991 Porsche 911 Carrera 2 Cabriolet\n\n\n1947 Dodge WC Pickup\n1974 Toyota Land Cruiser FJ40\n\n\nNo Reserve: Original-Owner 1979 Honda CB650\n68k-Mile 1992 Toyota Land Cruiser FJ80\n\n\n31-Years-Owned 1962 Porsche 356B Coupe\nNo Reserve: 1986 Alfa Romeo GTV6 Project\n\n\n1974 Porsche 914 2.0\nNo Reserve: 21k-Mile 1996 Volkswagen Cabrio 5-Speed\n\n\n1965 Sunbeam Tiger Pre-Production Mk 1A\n1972 Chevrolet Corvette 4-Speed\n\n\n1974 Jensen-Healey Mk II\n2003 BMW M5\n\n\nOriginal-Owner 1983 Caterham Super Seven\n18k-Mile 2004 Honda S2000\n\n\n22k-Mile 1983 DeLorean DMC-12 5-Speed\n1993 Land Rover Defender 110 200Tdi 5-Speed Soft Top\n\n\n41k-Mile 1987 Mercedes-Benz 560SL\nNo Reserve: 1975 Honda ST90\n\n\n1986 Ferrari Mondial 3.2\n7k-Mile 2010 Chevrolet Camaro Hendrick Motorsports 25th Anniversary Edition by Callaway\n\n\n1940 Ford Standard Tudor Sedan\nCustom 1936 Ford Roadster\n\n\nNo Reserve: 42k-Mile 2000 Porsche Boxster S 6-Speed\nNo Reserve: 3k-Mile 1982 Honda CB900C Custom\n\n\n1974 Porsche 911 Targa\nLone Star Classic LS427\n\n\n1958 Mercedes-Benz 190\n2009 BMW 335i M Sport 6-Speed\n\n\n"}, {"title": "BaT Auction: 1933 MG J1", "comments": "\nThis 1933 MG J1 was purchased by the previous owner in the UK in 1996 after it was used as a race car and retired to a barn for a number of years. It was subsequently imported to the US and received a cosmetic and mechanical refurbishment over a 12-year period before being acquired by the seller in 2018. The right-hand-drive car is finished in cream white and green over a green interior and features a green folding soft top, 19″ wire wheels, a leather bonnet strap, and an English burl oak dash. Power comes from an 847cc inline-four paired with a four-speed manual gearbox, and additional equipment includes twin SU carburetors and cable-operated drum brakes. This pre-war MG is not currently registered for street use, and is now offered with records, refurbishment photos, and a clean South Carolina title in the seller’s name.\n"}, {"title": "BaT Auction: 1982 Land Rover 88 Series III Santana", "comments": "\nThis 1982 Land Rover Series III is a left-hand-drive example that was built under license by Santana Motor S.A. in Spain. The truck was acquired by the seller in Columbia in 2018 and imported to the US in 2020. Finished in orange over a black vinyl interior with three individual front seats and two inward-facing jump seats, the truck is powered by a 2.25-liter gasoline inline-four paired with a four-speed manual gearbox and a two-speed transfer case. Accessories include a black vinyl top with roll-up windows, side steps, and manually-locking front hubs. This Santana is offered with import documentation and a Florida title in the name of the seller’s wife.\n"}, {"title": "BaT Auction: 30-Years-Owned 1957 Volkswagen Beetle", "comments": "\nThis 1957 Volkswagen Beetle was produced on December 27, 1956 and is finished in Coral Red over beige cloth. The car was sold new at Roger Beaudoin Automobiles in Sherbrooke, Quebec and was reportedly re-acquired by the dealership in 1972 and used as a display vehicle. It is said to have been stored following the dealership’s closure in the early 1980s and was acquired by the seller in 1990. Power is supplied by a 1,192cc flat-four paired with four-speed manual transaxle, and equipment includes chrome brightwork, a roof rack, quarter vent windows, and a push-button radio. This Beetle is offered in Canada with a letter from Volkswagen of America, a car cover, a tool roll, an owner’s manual, a service booklet, and Quebec registration.\n"}, {"title": "BaT Auction: 20k-Mile 2001 Qvale Mangusta", "comments": "\nThis 2001 Qvale Mangusta is one of 284 examples produced between 1999 and 2002 and is finished in metallic silver over black leather. The car was first registered in Indiana and acquired by the current owner in 2017 following time in Connecticut and New Jersey. Power is provided by a Ford SVT 4.6-liter DOHC V8 paired with a five-speed manual transmission, and equipment includes a a three-mode Rototop, 18″ Antera wheels, Brembo brake calipers, air conditioning, and a Pioneer touchscreen stereo. This Mangusta indicates just under 20k miles and is now offered by the seller on behalf of the owner with service records, a clean Carfax report, and a clean New Jersey title.\n"}, {"title": "BaT Auction: 1991 BMW 325i Cabriolet 5-Speed", "comments": "\nThis 1991 BMW 325i convertible is powered by a 2.5-liter inline-six paired with a five-speed manual transmission and finished in gold over a reupholstered tan interior. Features include a brown convertible top, sport seats, 14″ BBS wheels, a JVC stereo, and power windows. The car was acquired by the seller earlier in 2020 from a BMW specialty shop in San Diego, California, and service in preparation for the sale is said to have included a cylinder head overhaul as well as a tune-up and replacement of the thermostat, rear axle seals, a lower control arm bushing, and interior trim. This plastic-bumper E30 convertible is offered with manufacturer’s literature, a Carfax report, and a clean California title in the seller’s name.\n"}, {"title": "BaT Auction: 68k-Mile 1993 Toyota 4Runner SR5", "comments": "\nThis 1993 Toyota 4Runner SR5 is finished in white over a gray cloth interior and is powered by a 3.0-liter V6 mated to a four-speed automatic transmission and a dual-range transfer case. Equipment includes 15″ alloy wheels, a hitch receiver, a power rear window, air conditioning, cruise control, a rear cabin heater, and a cassette stereo. The seller acquired the truck in 2019 and has since added approximately 500 of the 68k miles now shown. Service during current ownership included a coolant flush and the replacement of the water pump, thermostat, timing belt, and air conditioning belt. This 4Runner is now offered with the owner’s manual, recent service records, a clean Carfax report, and a clean Colorado title in the seller’s name.\n"}, {"title": "BaT Auction: 1995 BMW M3", "comments": "\nThis 1995 BMW M3 is powered by a 3.0-liter DOHC inline-six paired with a five-speed manual gearbox and a limited-slip differential. Additional equipment includes 17″ Style 24 wheels, a sunroof, and an onboard computer as well as modifications such as Bilstein shocks, H&R springs, and an E46 ZHP steering rack. The car was acquired by the seller in November 2017 following a repaint in red, reupholstery of the front seats, replacement of cooling system components, cylinder head work, and more. A PPI was conducted and repairs carried out in preparation for the sale. This E36 M3 shows 163k miles and is offered with manufacturer’s literature, partial service records, a clean Carfax report, and a clean Nevada title in the seller’s name.\n"}]